#include <stdio.h>
#include <math.h>
#include <locale.h>

int main() {
	float r1, r2;
	float a, b, c, d, t;
	setlocale(LC_ALL, "Rus");
	printf("Введите координаты первой окружности ");
	scanf_s("%f%f", &a, &b);
	printf("Введите радиус первой окружности ");
	scanf_s("%f", &r1);
	printf("Введите координаты второй окружности ");
	scanf_s("%f%f", &c, &d);
	printf("Введите радиус второй окружности ");
	scanf_s("%f", &r2);
	t = sqrt((a - c) * (a - c) + (b - d) * (b - d));
	if (r1 <= 0 || r2 <= 0) {
		printf("Данные введены некорректно");
		return 0;
	}
	if (r1 == r2 && a == c && b == d) {
		printf("Окружности совпадают");
		//(0; 0; 1), (0; 0; 1)
	}
	else if (abs(r1 - r2) == t)
	{
		printf("Окружности касаются внутренним образом");
		//(0; 0; 3), (2; 0; 1)
	}
	else if ((r1 + r2) < t) {
		printf("Окружности не касаются, расположены не внутри друг друга");
		//(0; 0; 1), (200; 0; 1)
	}
	else if (t>abs(r1-2) && t<r1+r2) {
		printf("Окружности пересекаются");
		//(0; 0; 3), (2; 2; 3)
	}
	else if (r1 + r2 == t) {
		printf("Окружности касаются внешним образом");
		//(0, 0, 3) (2, 0, 1)
	}
	else {
		printf("Окружность внутри окружности");
	}
	return 0;
}