#include <stdio.h>
#include <math.h>
#include <locale.h>

int main() {
	float x_1, x_2, y_1, y_2, r_1, r_2, d, x, y;
	scanf_s("%f %f %f %f %f %f", &x_1, &y_1, &r_1, &x_2, &y_2, &r_2);
	setlocale(LC_ALL, "RUS");
	x = fabsf(x_1 - x_2);
	y = fabsf(y_1 - y_2);
	d = sqrtf(x * x + y * y);
	if (r_1 <= 0 || r_2 <= 0) {
		printf("Error");
		return 1;
	}
	if (d == 0) {
		//Окружности расположены одна в другой, центры совпали
		printf("Окружности одна в другой, центры совпали");
		return 0;
	}
	if (d < fabsf(r_1 - r_2)) {
		//Окружности расположены одна в другой, центры не совпали
		printf("Окружности одна в другой, центры не совпали");
		return 0;
	}
	if (d == fabsf(r_1 - r_2)) {
		//Окружности расположены одна в другой, касаются изнутри
		printf("Окружности одна в другой, касаются изнутри");
		return 0;
	}
	if (fabsf(r_1 - r_2) < d && d < r_1 + r_2) {
		//Окружности пересекаются
		printf("Окружности пересекаются");
		return 0;
	}
	if (d == r_1 + r_2) {
		//Окружности касаются снаружи
		printf("Окружности касаются снаружи");
		return 0;
	}
	
	
	printf("Окружности не пересекаются");
	return 0;
	

}
